In [55]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.model_selection import train_test_split

In [6]:
df = pd.read_csv("C:/Users/yasir/Downloads/Titanic.csv")

In [8]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
# checking for null
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [24]:
# dropping unnecessary columns
df.drop(columns = ['PassengerId','Name','Ticket','Cabin'], inplace= True)

KeyError: "['PassengerId', 'Name', 'Ticket', 'Cabin'] not found in axis"

In [22]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [26]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [31]:
# for demonstration 
# handling missing values
df['Age'].fillna(df['Age'].median(), inplace=True)

df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

C:\Users\yasir\AppData\Local\Temp\ipykernel_19260\826404131.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)
C:\Users\yasir\AppData\Local\Temp\ipykernel_19260\826404131.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

In [33]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [35]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [37]:
# classifying variables
categorical_features = ['Sex','Embarked']

In [43]:
ohe = OneHotEncoder(drop='first',sparse_output=False)
scaler = StandardScaler()

In [45]:
# Splitting the dataset x and y
X = df.drop(columns=['Survived'])
y = df['Survived']

In [51]:
X.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [53]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [57]:
# splitting to train and test using train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.2, random_state=42)

In [59]:
X_train.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked'], dtype='object')

In [61]:
numerical_features = ['Pclass','Age','SibSp','Parch']

In [63]:
categorical_features

['Sex', 'Embarked']

In [65]:
numerical_features

['Pclass', 'Age', 'SibSp', 'Parch']

In [67]:
# one hot encoding for Categorical features
X_train_Cat =  X_train[categorical_features]

X_test_Cat = X_test[categorical_features]

In [69]:
# processing numerical veribles seperately
X_train_num = X_train[numerical_features]

X_test_num = X_test[numerical_features]

In [73]:
X_test_num

     Pclass   Age  SibSp  Parch
709       3  28.0      1      1
439       2  31.0      0      0
840       3  20.0      0      0
720       2   6.0      0      1
39        3  14.0      1      0
..      ...   ...    ...    ...
433       3  17.0      0      0
773       3  28.0      0      0
25        3  38.0      1      5
84        2  17.0      0      0
10        3   4.0      1      1

[179 rows x 4 columns]

In [75]:
# Scaling only for X
X_train_num_scaled = scaler.fit_transform(X_train_num)
X_test_num_scaled = scaler.transform(X_test_num)

In [77]:
X_train_num_scaled

array([[-1.61413602,  1.25364106, -0.47072241, -0.47934164],
       [-0.40055118, -0.47728355, -0.47072241, -0.47934164],
       [ 0.81303367,  0.21508629, -0.47072241, -0.47934164],
       ...,
       [ 0.81303367,  0.90745614,  1.23056874, -0.47934164],
       [-1.61413602, -1.1696534 ,  0.37992316,  2.04874166],
       [-1.61413602, -0.63114352, -0.47072241,  0.78470001]])

In [81]:
X_train_num_scaled.mean()

3.77351084212483e-17

In [83]:
X_train_num_scaled.std()

0.9999999999999999

In [85]:
X_test_Cat

        Sex Embarked
709    male        C
439    male        S
840    male        S
720  female        S
39   female        C
..      ...      ...
433    male        S
773    male        C
25   female        S
84   female        S
10   female        S

[179 rows x 2 columns]

In [87]:
# one hot encoding for Categorical features
X_train_cat_encoded = ohe.fit_transform(X_train_Cat)
X_test_cat_encoded = ohe.transform(X_test_Cat)

In [93]:
X_train_cat_encoded

array([[1., 0., 1.],
       [1., 0., 1.],
       [1., 0., 1.],
       ...,
       [1., 0., 1.],
       [0., 0., 1.],
       [1., 0., 1.]])

In [95]:
# demo feature 
demo_features = ohe.get_feature_names_out(categorical_features)
X_train_view = pd.DataFrame(X_train_cat_encoded, columns = demo_features)
X_train_view.head()

   Sex_male  Embarked_Q  Embarked_S
0       1.0         0.0         1.0
1       1.0         0.0         1.0
2       1.0         0.0         1.0
3       1.0         0.0         1.0
4       0.0         0.0         1.0